#include <iostream>
using namespace std;

//1) Найти наибольший индекс i, такой что a[i] < a[i + 1].
//   Если такого i нет, то перестановка является последней(в порядке убывания). Алгоритм завершен.
//2) Найти наибольший индекс j, такой что j > i и a[i] < a[j].
//3) Поменять местами элементы на позициях i и j.
//4) Развернуть(перевернуть) последовательность от позиции i + 1 до конца массива.


int main()
{
    cout << "Second commit\n";
}

